testing/benchmarks/benchmarking-project/baseline-results/2025-10-25/mt-customer4.txt
pgbench (16.10 (Ubuntu 16.10-1.pgdg24.04+1))
starting vacuum...end.
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 10
query mode: simple
number of clients: 4
number of threads: 2
maximum number of tries: 1
duration: 90 s
number of transactions actually processed: 26723
number of failed transactions: 0 (0.000%)
latency average = 13.467 ms
initial connection time = 33.460 ms
tps = 297.021784 (without initial connection time)