testing/benchmarks/benchmarking-project/baseline-results/2025-10-25/multitenant-customer2.txt
pgbench (16.10 (Ubuntu 16.10-1.pgdg24.04+1))
starting vacuum...end.
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 10
query mode: simple
number of clients: 2
number of threads: 1
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 11450
number of failed transactions: 0 (0.000%)
latency average = 10.477 ms
initial connection time = 32.149 ms
tps = 190.896199 (without initial connection time)